# data/questions_db.py

questions_db = {
    "Ценности": [
        "Вся необходимая информация находится в свободном доступе",
        "Когда у меня возникают проблемы в работе, я с легкостью могу обсудить это с руководителем",
        "Я получаю рассылку для ознакомления с результатами различных проверок компании",
        "Я почувствовал себя частью коллектива достаточно быстро",
        "Я считаю работу в команде эффективнее, чем работу каждого в отдельности",
        "В начале моей работы в компании, мои коллеги всегда помогали мне",
        "Должность и оплата труда в моей компании сопоставимы",
        "Мой карьерный рост зависит от моей квалификации",
        "Я или мои коллеги часто предлагаем новые идеи и методы решения поставленных задач",
    ],
    "Коммуникации": [
        "Мне понятна политика компании",
        "При необходимости я могу обсудить любую задачу с коллегами из смежных отделов"
    ],
    "Лидерство": [
        "В компании есть человек, являющийся для меня примером",
        "Я убежден, что мои коллеги, по большей части, честны со мной"
    ],
    "Инновации": [
        "Я устроился в компанию достаточно быстро",
        "Мой рабочий график подстраивается под мои активные часы/нужды/потребности"
    ],
    "Работа в команде": [
        "Выполненные нами коллективные задачи важны для развития компании",
        "Я всегда могу положиться на своих коллег в решении рабочих задач"
    ],
    "Работа и личная жизнь": [
        "Я с уверенностью могу запланировать свой отдых в утвержденные заранее даты",
        "В нашей компании есть места для отдыха/принятия пищи"
    ]
}

events_db = {
    "Ценности": [
        "размещение нормативные документы в свободном доступе (эл. формат) для каждого сотрудника. Создание электронной площадки для обмена информацией. Регулярные рассылки с новшествами и изменениями.",
        "Регламентирование времени встреч для решения личных и рабочих вопросов сотрудников. Открытое изложение собственного мнения",
        "Организация свободного доступа результатов аудитов и проверок, их рассылка внутри компании с рекомендациями и комментариями для сотрудников",
        "Контроль качества обучения наставником и руководителем. Вручение приветственного набора.",
        "Подключение к текущим командным задам нового сотрудника. Внедрение культуры уважения идей и опыта нового сотрудника.",
        "Регулярное проведение обучений и тренингов для наставников, оценка подопечными и руководством наставников",
        "Внедрение системы грейдирования, создание равных возможностей получения вознаграждений",
        "открытый конкурс на руководящие должности, равные критерии оценки квалификации и соответствие должности",
        "соответственно квалификации и направлению деятельности, постоянное обучение и повышение квалификации сотрудников ",
        "Информирование и разъяснение «узких» мест сотрудникам, развитие гибкости руководителей и их способности к быстрой адаптации",
        "нематериальная мотивация персонала, организация «банка идей» ",
        "создать упрощенный путь реализации идей (минимизация шагов), штатный сотрудник по вопросам внедрения инноваций",
    ],
    "Коммуникации": [
        "Развитие позитивного микроклимата в коллективе",
        "Тиражирование компетенций"
    ],
    "Лидерство": [
        "Формировать стремление сотрудников ориентироваться на руководителя",
        "Популяризация персональных достижений"
    ],
    "Инновации": [
        "Ведение электронной трудовой книжки",
        "Индивидуальный трудовой договор для каждого сотрудника"
    ],
    "Работа в команде": [
        "Соблюдение и трансляция руководством миссии, целей и стратегии развития компании",
        "Установление коллективной приоритетной задачи"
    ],
    "Работа и личная жизнь": [
        "Облегченная процедура оформления заявлений на отсутствие на рабочем месте",
        "Организация пространств для отдыха и приема пищи"
    ]
}